app/Http/Controllers/urway/UrWayController.php

    public function payment_response(Request $request){

        $payment = Payment::where('trackid',$request->TrackId)->first();
---
select * from `payments` where `trackid` = '2224016' limit 1

                            $subscribe->payment_id = $payment->id;
                            $subscribe->starts_at = Carbon::now()->format('Y-m-d');
                            $subscribe->ends_at = Carbon::now()->addMonth()->format('Y-m-d');
                            $subscribe->save();
---
insert into `subscribes` (`user_id`, `team_id`, `plan_id`, `payment_id`, `starts_at`, `ends_at`, `updated_at`, `created_at`) values (5, 6, 1, 5, '2021-04-26', '2021-05-26', '2021-04-26 14:16:11', '2021-04-26 14:16:11')