app/Http/Controllers/Account/AccountController.php

    public function payments(){
        $payments = Payment::where('team_id',currentTeam()->id)->orderByDesc('id')->get();
---
select * from `payments` where `payments`.`team_id` = 6 and `payments`.`team_id` is not null