app/Http/Controllers/Account/BranchesController.php

select * from `cities` where `cities`.`team_id` = 6 and `cities`.`team_id` is not null
select * from `branches` where `branches`.`team_id` = 6 and `branches`.`team_id` is not null
---
    public function index(){
        $cities = Team::find(currentTeam()->id)->cities;
        $branches = Team::find(currentTeam()->id)->branches;

insert into `cities` (`name`, `team_id`, `updated_at`, `created_at`) values ('Default City', 6, '2021-04-26 18:02:11', '2021-04-26 18:02:11')
insert into `branches` (`name`, `city_id`, `team_id`, `phone`, `address`, `longitude`, `latitude`, `updated_at`, `created_at`) values ('fdfd', 8, 6, '', '', '', '', '2021-04-26 18:02:12', '2021-04-26 18:02:12')
---
    public function store(Request $request){
        $this->validate($request, [
            'name' => 'required|string|min:3',
        ]);
        if($request->city == 0){
            $city = new City();
            if($request->city_name == '')
                $request->city_name = 'Default City';

            $city->name = $request->city_name;
            $city->team_id = currentTeam()->id;
            $city->save();
            $request->city = $city->id;
        }
        $branch = new Branch();
        $branch->name = $request->name;
        $branch->city_id = $request->city;
        $branch->team_id = currentTeam()->id;
        $branch->phone = $request->phone;
        $branch->address = $request->address;
        $branch->longitude = $request->longitude;
        $branch->latitude = $request->latitude;
        $branch->save();

delete from `branches` where `id` = 10
---
    public function delete($branch){
        $branch = Branch::find($branch);
        foreach ($branch->points as $point){
            foreach ($point->form->responses as $response){
                FeedbackResponse::find($response->id)->delete();
            }
            foreach ($point->form->questions as $question){
                foreach ($question->qanswers as $answer){
                    QuestionAnswer::find($answer->id)->delete();
                }
                FormQuestion::find($question->id)->delete();
            }
            $point->delete();
        }
        $branch->delete();