app/Http/Controllers/Account/DashboardController.php

    public function index(){
        $team = Team::find(currentTeam()->id);
        $forms = $team->forms;
        $responses = FeedbackResponse::whereIn('form_id',$forms->pluck('id')->toArray())->orderByDesc('created_at')->paginate(10);
        $allresponses = FeedbackResponse::whereIn('form_id',$forms->pluck('id')->toArray())->orderByDesc('created_at')->get();
        //*Excellent Data*//

        $total_responses = FeedbackResponse::whereIn('form_id',$forms->pluck('id')->toArray())
            ->where(function($query) {
                $query->where('created_at','<',
                    Carbon::now()->addDays(1)->format('Y-m-d'));
                    $query->where('created_at','>',
                        Carbon::now()->subDays(6)->format('Y-m-d'));
            })->count();

        $total_excellent = FeedbackResponse::where(function($query)  {
            $query->where('team_id', currentTeam()->id);
            $query->where('rate', 'excellent');
            if(isset($request->city_id) && $request->city_id != 'all')
                $query->where('city_id', $request->city_id);
            if(isset($request->branch_id) && $request->branch_id != 'all' ){
                $query->where('branch_id', $request->branch_id);
            }
            if(isset($request->date_range)){
                $start_date = explode(' - ',$request->date_range)[0];
                $end_date = explode(' - ',$request->date_range)[1];
                $carbon_start_date = Carbon::createFromFormat('m/d/Y', $start_date)->format('Y-m-d');
                $carbon_end_date = Carbon::createFromFormat('m/d/Y', $end_date)->format('Y-m-d');
                $query->whereBetween('created_at',[$carbon_start_date,$carbon_end_date])->get();
            }
        })->get()->count();
---
select count(*) as aggregate from `feedback_responses` where `form_id` in (8)
select count(*) as aggregate from `feedback_responses` where `form_id` in (8) and (`created_at` < '2021-04-27' and `created_at` > '2021-04-20')
select * from `feedback_responses` where (`team_id` = 6 and `rate` = 'excellent')

        }
//*Excellent Data*//
        //*average Data*//
        $total_average = FeedbackResponse::where(function($query) {
            $query->where('team_id', currentTeam()->id);
            $query->where('rate', 'average');
            if(isset($request->city_id) && $request->city_id != 'all')
                $query->where('city_id', $request->city_id);
            if(isset($request->branch_id) && $request->branch_id != 'all' ){
                $query->where('branch_id', $request->branch_id);
            }
            if(isset($request->date_range)){
                $start_date = explode(' - ',$request->date_range)[0];
                $end_date = explode(' - ',$request->date_range)[1];
                $carbon_start_date = Carbon::createFromFormat('m/d/Y', $start_date)->format('Y-m-d');
                $carbon_end_date = Carbon::createFromFormat('m/d/Y', $end_date)->format('Y-m-d');
                $query->whereBetween('created_at',[$carbon_start_date,$carbon_end_date])->get();
            }
        })->get()->count();
---
select * from `feedback_responses` where (`team_id` = 6 and `rate` = 'average')

        }
    //*Average Data*//
        //*Poor Data*//
        $total_poor = FeedbackResponse::where(function($query) {
            $query->where('team_id', currentTeam()->id);
            $query->where('rate', 'verypoor');
            if(isset($request->city_id) && $request->city_id != 'all')
                $query->where('city_id', $request->city_id);
            if(isset($request->branch_id) && $request->branch_id != 'all' ){
                $query->where('branch_id', $request->branch_id);
            }
            if(isset($request->date_range)){
                $start_date = explode(' - ',$request->date_range)[0];
                $end_date = explode(' - ',$request->date_range)[1];
                $carbon_start_date = Carbon::createFromFormat('m/d/Y', $start_date)->format('Y-m-d');
                $carbon_end_date = Carbon::createFromFormat('m/d/Y', $end_date)->format('Y-m-d');
                $query->whereBetween('created_at',[$carbon_start_date,$carbon_end_date])->get();
            }
        })->get()->count();
---
select * from `feedback_responses` where (`team_id` = 6 and `rate` = 'verypoor')

    public function reports(Request $request){
        $team = Team::find(currentTeam()->id);
        $forms = $team->forms;
        $cities = $team->cities;
        $branches = $team->branches;
        $points = $team->points;
        if(isset($request->city_id) && $request->city_id!='all'){
            $branches = City::find($request->city_id)->branches;
        }
        if(isset($request->branch_id) && $request->branch_id!='all'){
            $points = Branch::find($request->city_id)->points;
        }
        $responses = FeedbackResponse::where(function($query) use($request) {
            $query->where('team_id', currentTeam()->id);
            if(isset($request->city_id) && $request->city_id != 'all')
                $query->where('city_id', $request->city_id);
            if(isset($request->branch_id) && $request->branch_id != 'all' ){
                $query->where('branch_id', $request->branch_id);
            }
            if(isset($request->point_id) && $request->point_id != 'all' ){
                $form = Point::find($request->point_id)->form;
                $query->where('form_id', $form->id);
            }
            if(isset($request->date_range)){
                $start_date = explode(' - ',$request->date_range)[0];
                $end_date = explode(' - ',$request->date_range)[1];
                $carbon_start_date = Carbon::createFromFormat('m/d/Y', $start_date)->format('Y-m-d');
                $carbon_end_date = Carbon::createFromFormat('m/d/Y', $end_date)->format('Y-m-d');
                $query->whereBetween('created_at',[$carbon_start_date,$carbon_end_date])->get();
            }
        })->get();
---
select * from `cities` where `cities`.`team_id` = 6 and `cities`.`team_id` is not null
select * from `branches` where `branches`.`team_id` = 6 and `branches`.`team_id` is not null
select * from `points` where `points`.`team_id` = 6 and `points`.`team_id` is not null
select * from `feedback_responses` where (`team_id` = 6)