app/Http/Controllers/Account/SettingsController.php

select * from `team_settings` where `team_id` = 6 limit 1
---
    public function index(){
        $settings = TeamSetting::where('team_id',currentTeam()->id)->first();